{
    "Singapore": [
        {
            "Adventure": [
                {
                    "Name": "Universal Studios Singapore",
                    "Description": "Go beyond the screen and Ride The Movies™ at Universal Studios Singapore™ at Resorts World™ Sentosa. Experience cutting-edge rides, shows, and attractions based on your favorite blockbuster films and television series.",
                    "Opening Hours": "10am - 8pm"
                },
                {
                    "Name": "iFly Singapore",
                    "Description": "Experience the thrill of skydiving in one of the world's largest indoor skydiving wind tunnels at iFly Singapore on Sentosa Island.",
                    "Opening Hours": "9am - 10pm daily, except Wednesday:11am - 10pm",
                },
                {
                    "Name": "AJ Hackett Sentosa",
                    "Description": "AJ Hackett Sentosa is home to Singapore's first and only bungy tower, giant swing, and skybridge for those seeking a rush of adrenaline and adventure.",
                    "Opening Hours": "11.30am - 7.30pm daily",
                },
                {
                    "Name": "Mega Adventure Park",
                    "Description": "At Mega Adventure Park, take on the MegaZip, a 450-meter zip line that sends you flying over the jungle canopy of Sentosa Island.",
                    "Opening Hours": "Monday to Thursday: 11am - 6pm, Friday to Sunday: 11am - 6.30pm",
                },
                {
                    "Name": "Forest Adventure Singapore",
                    "Description": "Forest Adventure is Singapore's only treetop obstacle course located at Bedok Reservoir Park, offering a fun and challenging experience for all ages.",
                    "Opening Hours": "Monday: 9.30am - 2pm, Tuesday to Friday: 9.30am - 6pm, Saturday to Sunday/ PH: 9.30am - 6.30pm",
                },
                {
                    "Name": "Singapore Luge",
                    "Description": "Wave House Sentosa is the ultimate beach destination, offering the perfect wave rides for surfing and bodyboarding.",
                    "Opening Hours": "Monday to Thursday and Sunday: 10am - 7.30pm, Friday and Saturday: 10am - 9pm",
                },
                {
                    "Name": "Singapore Wake Park",
                    "Description": "Singapore Wake Park is Singapore’s only cable-ski park, offering wakeboarding and waterskiing for enthusiasts of all levels.",
                    "Opening Hours": "10am - 8pm daily",
                },
                {
                    "Name": "Adventure Cove Waterpark",
                    "Description": "Come experience the exhilaration and adrenaline rush of zipping down water slides at Southeast Asia’s only integrated aquatic and marine life park!",
                    "Opening Hours": "10am - 5pm daily",
                }
            ]
        },
        {
            "Shopping": [
                {
                    "Name": "Orchard Road",
                    "Description": "Singapore's premier shopping street, featuring a wide range of high-end and mid-range retail stores, dining options, and entertainment.",
                    "Opening Hours": "Varies by shop (generally 10am - 10pm)"
                },
                {
                    "Name": "VivoCity",
                    "Description": "The largest shopping mall in Singapore, offering a diverse mix of retail, dining, and entertainment options, including a rooftop sky park.",
                    "Opening Hours": "Daily, 10am - 10pm"
                },
                {
                    "Name": "The Shoppes at Marina Bay Sands",
                    "Description": "A luxury shopping destination with high-end brands, fine dining, and a spectacular view of the Marina Bay waterfront.",
                    "Opening Hours": "Daily, 11am - 10pm"
                },
                {
                    "Name": "Bugis Street Market",
                    "Description": "One of the largest and cheapest places to shop in Singapore, offering a wide variety of fashion, accessories, and souvenirs.",
                    "Opening Hours": "Daily, 11am - 10pm"
                },
                {
                    "Name": "Mustafa Centre",
                    "Description": "A 24-hour shopping mall in Little India, known for its vast array of products at competitive prices, from electronics to groceries.",
                    "Opening Hours": "Open 24 hours"
                },
                {
                    "Name": "ION Orchard",
                    "Description": "A stylish shopping mall on Orchard Road, featuring a mix of luxury and high-street brands, as well as fine dining and an observation deck.",
                    "Opening Hours": "Daily, 10am - 10pm"
                },
                {
                    "Name": "Suntec City Mall",
                    "Description": "A major shopping and entertainment complex with a wide range of retail outlets, dining options, and the famous Fountain of Wealth.",
                    "Opening Hours": "Daily, 10am - 10pm"
                },
                {
                    "Name": "Haji Lane",
                    "Description": "A vibrant street in Kampong Glam known for its indie boutiques, unique fashion stores, and hip cafes.",
                    "Opening Hours": "Open 24 hours (Shops generally open from 11am - 8pm)"
                }
            ]
        },
        {
            "Sight-seeing": [
                {
                    "Name": "Marina Bay Sands SkyPark",
                    "Description": "Enjoy panoramic views of Singapore's skyline from the observation deck of the iconic Marina Bay Sands hotel.",
                    "Opening Hours": "Daily, 11am - 9pm"
                },
                {
                    "Name": "Gardens by the Bay",
                    "Description": "Explore futuristic gardens, including the Flower Dome, Cloud Forest, and Supertree Grove, with breathtaking landscapes and innovative designs.",
                    "Opening Hours": "Daily, 9am - 9pm"
                },
                {
                    "Name": "Merlion Park",
                    "Description": "Visit the iconic Merlion statue, a symbol of Singapore, with stunning views of Marina Bay.",
                    "Opening Hours": "Open 24 hours"
                },
                {
                    "Name": "Singapore Flyer",
                    "Description": "Ride one of the world's largest observation wheels for a bird's-eye view of the city and beyond.",
                    "Opening Hours": "Thursday to Sunday, 2pm - 10pm"
                },
                {
                    "Name": "Clarke Quay",
                    "Description": "A riverside quay with a vibrant nightlife, offering a mix of restaurants, bars, and clubs along the Singapore River.",
                    "Opening Hours": "Varies by establishment (generally open from 10am - late)"
                },
                {
                    "Name": "Chinatown",
                    "Description": "Discover the rich heritage and culture of Singapore's Chinese community, with traditional shops, temples, and delicious street food.",
                    "Opening Hours": "Open 24 hours (Shops generally open from 10am - 10pm)"
                },
                {
                    "Name": "Little India",
                    "Description": "Immerse yourself in the sights, sounds, and flavors of Singapore's Indian community, with colorful shops, temples, and markets.",
                    "Opening Hours": "Open 24 hours (Shops generally open from 10am - 10pm)"
                },
                {
                    "Name": "Haji Lane",
                    "Description": "A narrow alley in Kampong Glam known for its eclectic mix of boutiques, cafes, and vibrant street art.",
                    "Opening Hours": "Open 24 hours (Shops generally open from 11am - 8pm)"
                }
            ]
        }
    ]
}
        
          
